In [1]:
# 데이터프레임 생성하기
import pandas as pd

In [3]:
friend_dict_list=[
    {'name':'John', 'age':25,'job':'student'},
    {'name':'Yunju', 'age':23,'job':'teacher'}]

In [4]:
df=pd.DataFrame(friend_dict_list)

In [5]:
df  #원래의 경우 age,name,job순으로 뜨지만 나는 제대로 뜸.

    name  age      job
0   John   25  student
1  Yunju   23  teacher

In [6]:
#컬럼들을 원하는 순서로 하려면 어떻게하나?
df=df[['age','name','job']]

In [7]:
df

   age   name      job
0   25   John  student
1   23  Yunju  teacher

In [9]:
#한번에 다 바꾸려면?
from collections import OrderedDict
#dictionary는 순서를 보장하지 않으므로, 컬럼의 순서가 보장되지 않는다.
# OrderedDict는 dictionary의 순서를 보장한다.

In [11]:
friend_ordered_dict=OrderedDict(
    [
        ('name',['John','Yunju']),
        ('age',[25,23]),
        ('job',['student','teacher'])
    ]
)

In [12]:
df=pd.DataFrame.from_dict(friend_ordered_dict)

In [13]:
df.head()

    name  age      job
0   John   25  student
1  Yunju   23  teacher

In [17]:
#list사용하여 만들기
friend_list=[
    ['John',20,'student'],
    ['Yunju',23,'teacher']
]

In [21]:
column_name=['name','age','job']

In [24]:
df=pd.DataFrame.from_records(friend_list,columns=column_name)

In [25]:
df

    name  age      job
0   John   20  student
1  Yunju   23  teacher

In [30]:
#리스트로 한번에 만드는 방법
friend_list=[
    ['name',['John','Yunju']],
    ['age',[20,23]],
    ['job',['student','teacher']]
]

In [33]:
# df=pd.DataFrame.from_items(friend_list)
# 위 코드는 더이상 되지 않는다.

In [35]:
import collections

In [36]:
df=pd.DataFrame.from_dict(collections.OrderedDict(friend_list))

In [37]:
df

    name  age      job
0   John   20  student
1  Yunju   23  teacher

In [ ]:
#리스트를 사용하려면 위와 같이 해야한다.